app/views/main/market.html.erb

SELECT "markets".* FROM "markets" ORDER BY "markets"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    </thead>
    <% u = Market.all.first%>
    <% x = User.where(id: u.user_id).first%>
    <% y = Item.where(id: u.item_id).first%>