app/views/main/my_inventory.html.erb

        <% @inven.each do |i| %>
        <% item_name = Item.where(id: i.item_id).first.name%>
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]