app/views/main/purchase.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @history.each do |his| %>
        <% item_name = Item.where(id: his.item_id).first.name%>
        <% seller_name = User.where(id: his.seller_id).first.name%>