app/views/main/topseller.html.erb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."created_at" >= ? ORDER BY "inventories"."id" ASC LIMIT ?  [["created_at", nil], ["LIMIT", 1]]
SELECT seller_id, item_id, sum(price * quantity) as total_price FROM "inventories" WHERE "inventories"."created_at" >= ? GROUP BY "inventories"."item_id" ORDER BY total_price DESC LIMIT ?  [["created_at", "2022-12-01 20:46:00"], ["LIMIT", 1]]
SELECT seller_id, item_id, sum(quantity) as total_amount FROM "inventories" WHERE "inventories"."created_at" >= ? GROUP BY "inventories"."item_id" ORDER BY total_amount DESC LIMIT ?  [["created_at", "2022-12-01 20:46:00"], ["LIMIT", 1]]
---
<%if session[:create]%>
    <%$x = Inventory.where(created_at: @startDate..@Finaldate)%>
    <%$total = Inventory.where(created_at: @startDate..@Finaldate).select("seller_id, item_id, sum(price * quantity) as total_price").group("item_id").order("total_price DESC")%>
    <%$amount = Inventory.where(created_at: @startDate..@Finaldate).select("seller_id, item_id, sum(quantity) as total_amount").group("item_id").order("total_amount DESC")%>

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% $total = $total.first%>
                <th><%=User.where(id: $total.seller_id).first.name%></th>
                <th><%=Item.where(id: $total.item_id).first.name%></th>

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <%$amount = $amount.first%>
                <th><%=User.where(id: $amount.seller_id).first.name%></th>
                <th><%=Item.where(id: $amount.item_id).first.name%></th>