app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"