app/controllers/main_controller.rb

  def create
    # check overlap login?
    if is_login?
      redirect_to main_path, notice: 'Please logout your account before login again!'
    else
      # check login authenticate with password?
      u = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "b@b"], ["LIMIT", 1]]

  def history
    must_be_logged_in
    u = User.where(id: session[:id]).first
    if u and ((u.user_type == 0) or (u.user_type == 2))
      @history = Inventory.where(user_id: session[:id]).order(:created_at)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ? ORDER BY "inventories"."created_at" ASC  [["user_id", 1]]

  def inventory
    must_be_logged_in
    @inven = Market.where(user_id: session[:id])
---
SELECT "markets".* FROM "markets" WHERE "markets"."user_id" = ?  [["user_id", 1]]

  def buy
    @amount = params[:amount].to_i
    $m = Market.where(id: params[:f_id]).first
    $I = Inventory.new
    if @amount > $m.quantity
      redirect_to my_market_path , notice: "the quantity of this goods is not enough"
    else
      $m.quantity -= @amount
      $m.save
      $I.user_id = session[:id].to_i
      $I.item_id = $m.item_id
      $I.seller_id = $m.user_id
      $I.price = $m.price
      $I.quantity = @amount
      $I.save
---
SELECT "markets".* FROM "markets" WHERE "markets"."id" = ? ORDER BY "markets"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "markets" SET "quantity" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["quantity", 96], ["updated_at", "2022-12-13 17:58:46.493690"], ["id", 9]]
INSERT INTO "inventories" ("user_id", "item_id", "seller_id", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 2], ["seller_id", 2], ["price", 199.0], ["quantity", 4], ["created_at", "2022-12-13 17:58:46.502612"], ["updated_at", "2022-12-13 17:58:46.502612"]]