app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @markets = Market.all

INSERT INTO "markets" ("user_id", "item_id", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 1], ["price", 10000.0], ["quantity", 1], ["created_at", "2022-12-09 22:05:38.219180"], ["updated_at", "2022-12-09 22:05:38.219180"]]
---
  def create
    @market = Market.new(market_params)

    respond_to do |format|
      if @market.save

DELETE FROM "markets" WHERE "markets"."id" = ?  [["id", 2]]
---
  def destroy
    @market.destroy

SELECT "markets".* FROM "markets" WHERE "markets"."id" = ? ORDER BY "markets"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "markets" SET "quantity" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["quantity", 2], ["updated_at", "2022-12-09 22:35:27.623591"], ["id", 1]]
---
  def updateInventory
    u = Market.where(id: params[:market_id]).first
    u.quantity = params[:quantity]
    u.price = params[:price]
    u.save

SELECT "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_market
      @market = Market.find(params[:id])