app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "abc"], ["updated_at", "2022-12-09 12:49:27.269994"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2022-12-09 12:31:00.795469"], ["password_digest", "[FILTERED]"], ["id", 1]]
---
  def newPassword
    u = User.where(id: session[:id]).first
    if u and u.authenticate(params[:password])
      if params[:newPassword] and (params[:newPassword] == params[:confirmPassword])
        u.password = params[:newPassword]
        u.save